experiments/drag_cube/foam_case/system/optimisationDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      optimisationDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

optimisationManager singleRun;

primalSolvers
{
    op1
    {
        active                 true;
        type                   incompressible;
        solver                 simple;

        solutionControls
        {
            consistent yes;
            nIters 1000; // was 1000
            residualControl
            {
                "p.*"       1.e-5;
                "U.*"       1.e-5;
            }
            averaging
            {
                average     true;
                startIter   500; // was 500
            }
        }
    }
}

adjointManagers
{
    adjManager1
    {
        primalSolver             op1;
        adjointSolvers
        {
            adjS1
            {
                // choose adjoint solver
                //----------------------
                active                 true;
                type                   incompressible;
                solver                 adjointSimple;

                // manage objectives
                //------------------
                objectives
                {
                    type incompressible;
                    objectiveNames
                    {
                        drag
                        {
                            weight     1.;
                            type       force;
                            patches    ("dragObject.*");
                            direction  (1 0 0);
                            Aref       1.0;
                            rhoInf     1;
                            UInf       1; // was 20
                            normalise       false;
                        }
                    }
                }
                // ATC treatment
                //--------------
                ATCModel
                {
                    ATCModel          standard;
                    extraConvection   0;
                    nSmooth           0;
                    zeroATCPatchTypes (wall patch);
                    maskType          pointCells;
                }
                // solution control
                //------------------
                solutionControls
                {
                    consistent yes;
                    nIters 1000; // was 1000
                    residualControl
                    {
                        "pa.*"       1.e-5;
                        "Ua.*"       1.e-5;
                    }
                }
            }
            // vol
            // {
            //     // choose adjoint solver
            //     //----------------------
            //     active                 true;
            //     type                   null;

            //     // manage objectives
            //     //------------------
            //     objectives
            //     {
            //         type                geometric;
            //         objectiveNames
            //         {
            //             vol
            //             {
            //                 weight          1;
            //                 type            partialVolume;
            //                 patches         (dragObjectGroup);

            //             }
            //         }
            //     }
            // }
        }
    }
}


optimisation
{
    designVariables
    {
        sensitivityType    surfacePoints;
        patches            (dragObjectGroup);
        includeSurfaceArea true;
        includeMeshMovement true; // default = true (ESI), false: SI
        writeAllSurfaceFiles  true;
    }
}
// ************************************************************************* //
